# Class 02: Pandas 操作

#### Note: 這份教材並不包含所有 Pandas 的操作  
歡迎自行上網找各種 Reference

### 載入 Pandas

In [2920]:
import pandas as pd
print(pd.__version__)

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args

    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)

    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

2.2.3

### Series
一種資料結構  
同時具有 numpy array 與 Dictionary 的特性

In [2921]:
s1 = pd.Series([1, 2, 3, 4, 5])
print(s1)
s2 = pd.Series([7, 8, 9, 10, 100], index=['a', 'b', 'c', 'd', 'e'])
print(s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
a      7
b      8
c      9
d     10
e    100
dtype: int64

想要知道有哪些 key 值: keys(), index  
想要知道有哪些 values: values  
兩個都想要: items()

In [2922]:
print(s2.keys())
print(s2.index)
print(s1.values)
print(s1.items())

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[1 2 3 4 5]
<zip object at 0x000001D8A0E2BF00>

資料的 query 方式跟 Dictionary 基本上一樣  
輸入 key 就能得到 value

In [2923]:
print(s1[3])
print(s2['b'])

4
8

當然，還有 numpy 的方式

In [2924]:
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2925]:
print(s1[1:3])

1    2
2    3
dtype: int64

In [2926]:
print(s2["a" : "d"])

a     7
b     8
c     9
d    10
dtype: int64

In [2927]:
print(s1[s1 > 2])

2    3
3    4
4    5
dtype: int64

In [2928]:
s3 = pd.Series(["a", "b", "c", "d", "e"], index = [1, 3, 5, 7, 9])
print(s3)

1    a
3    b
5    c
7    d
9    e
dtype: object

In [2929]:
print(s3.loc[3])
# print(s3.loc[2]) 會出現 error，因為 index 2 不存在
print(s3.iloc[2])

b
c

In [2930]:
data = pd.read_csv("social_media.csv")

### 練習1: 選取「平均每日社群軟體使用時間」欄位建立Series

In [2931]:
usage_time = data["平均每日社群軟體使用時間"]
print(usage_time)

0      7.0
1      5.0
2      9.0
3      7.0
4      5.0
      ...
426    NaN
427    NaN
428    NaN
429    NaN
430    NaN
Name: 平均每日社群軟體使用時間, Length: 431, dtype: float64

### 練習2: 計算這個欄位的平均、最大、最小值

In [2932]:
print("平均使用時間:", usage_time.mean())
print("最大使用時間:", usage_time.max())
print("最小使用時間:", usage_time.min())

平均使用時間: 4.419939577039275
最大使用時間: 9.0
最小使用時間: 1.0

### 練習3: 找出使用時間 > 5 的資料數量

In [2933]:
print("使用時間大於5小時的人數:", usage_time[usage_time > 5].count())

使用時間大於5小時的人數: 57

### DataFrame
可以看成多個 Series 合併在一起  
並且為每個 Series (DataFrame 的 column)給予一個名稱

In [2934]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'Florida': 170312, 'New York': 141297,
                  'Pennsylvania': 119280})
pop = pd.Series({'California': 39538223, 'Texas': 29145505,
                 'Florida': 21538187, 'New York': 20201249,
                 'Pennsylvania': 13002700})
data = pd.DataFrame({'area':area, 'pop':pop})
# data = pd.DataFrame([area, pop], columns=['area', 'pop'])
data

                area       pop
California    423967  39538223
Texas         695662  29145505
Florida       170312  21538187
New York      141297  20201249
Pennsylvania  119280  13002700

In [2935]:
data["pop"]

c:\Users\99000\OneDrive\桌面\python\Lib\site-packages\IPython\core\displayhook.py:281: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

California      39538223
Texas           29145505
Florida         21538187
New York        20201249
Pennsylvania    13002700
Name: pop, dtype: int64

In [2936]:
data['density'] = data['pop'] / data['area']
data

                area       pop     density
California    423967  39538223   93.257784
Texas         695662  29145505   41.896072
Florida       170312  21538187  126.463121
New York      141297  20201249  142.970120
Pennsylvania  119280  13002700  109.009893

In [2937]:
data.iloc[::2, 2:3]
data.loc[: "New York", "pop":]
data.loc[data.density > 100, ["area", "density"]]

                area     density
Florida       170312  126.463121
New York      141297  142.970120
Pennsylvania  119280  109.009893

### Series / DataFrame 的合併

In [2938]:
a = pd.DataFrame({"a" : [1, 2, 3], "b" : [4, 5, 6], "c" : [7, 8, 9]})
b = pd.DataFrame({"a" : [10, 11], "b" : [12, 13]})
print(a)
b

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

    a   b
0  10  12
1  11  13

In [2939]:
print(a + b)
a.add(b, fill_value=0)
# print(b.add(a, fill_value=0))

      a     b   c
0  11.0  16.0 NaN
1  13.0  18.0 NaN
2   NaN   NaN NaN

      a     b    c
0  11.0  16.0  7.0
1  13.0  18.0  8.0
2   3.0   6.0  9.0

In [2940]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[1, 2, 3])
pd.concat([ser1, ser2])

1    A
2    B
3    C
1    D
2    E
3    F
dtype: object

In [2941]:
print(pd.concat([ser1, ser2], axis=1))
pd.concat([ser1, ser2], axis = 0, ignore_index=True)
# pd.concat([ser1, ser2], axis = "columns")

   0  1
1  A  D
2  B  E
3  C  F

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [2942]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering',
                              'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [2943]:
pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [2944]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [2945]:
df3 = pd.merge(df1, df3, left_on="employee", right_on="name")
df3

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [2946]:
df3.drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [2947]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a)
print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [2948]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [2949]:
pd.merge(df1a, df3, left_index=True, right_on='employee')

       group_x employee      group_y  name  salary
0   Accounting      Bob   Accounting   Bob   70000
1  Engineering     Jake  Engineering  Jake   80000
2  Engineering     Lisa  Engineering  Lisa  120000
3           HR      Sue           HR   Sue   90000

In [2950]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
print(df6)
print(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer

In [2951]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [2952]:
pd.merge(df6, df7, how='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [2953]:
pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [2954]:
data = pd.read_csv("social_media.csv")
print(data.shape)

(431, 60)

### 缺失值處理

In [2955]:
data1 = data.dropna()

In [2956]:
data2 = data[data["此題請填4，否則問卷無效"] == 4]
# data = data.drop(data[data["此題請填4，否則問卷無效"] != 4].index)

In [2957]:
data3 = data.fillna(0)
# data4 = data.fillna(method='ffill')
# data5 = data.fillna(method='bfill')

### 練習4: 篩選出「此題請填4，否則問卷無效」為4的有效問卷

In [2958]:
valid_data = data[data["此題請填4，否則問卷無效"] == 4]
print("有效問卷數量:", len(valid_data))

有效問卷數量: 296

### 練習5: 檢查資料中缺失值，並將缺失值以0填補

In [2959]:
filled_data = data.fillna(0)

### 練習6: 統計「生理性別」欄位中男性與女性的數量

In [2960]:
gender_counts = data["生理性別"].value_counts()
print("性別分布:")
print(gender_counts)

性別分布:
生理性別
女性    191
男性    140
Name: count, dtype: int64

In [2961]:
data = data.dropna()
data = data.drop(data[data["此題請填4，否則問卷無效"] != 4].index)
print(data["平均每日社群軟體使用時間"].count())
print(data["平均每日社群軟體使用時間"].sum())
print(data["平均每日社群軟體使用時間"].mean())
print(data["平均每日社群軟體使用時間"].std())
print(data["平均每日社群軟體使用時間"].var())
print(data["平均每日社群軟體使用時間"].max())
print(data["平均每日社群軟體使用時間"].min())
print(data["平均每日社群軟體使用時間"].median())
print(data["平均每日社群軟體使用時間"].mode())

296
1346.0
4.547297297297297
1.9269171284176394
3.7130096197892812
9.0
1.0
5.0
0    5.0
Name: 平均每日社群軟體使用時間, dtype: float64

In [2962]:
df = data.groupby("綜合來說我最喜歡什麼社交軟體？")
print(df.size())
print(data["綜合來說我最喜歡什麼社交軟體？"].unique())

綜合來說我最喜歡什麼社交軟體？
Dcard          3
Discord       18
Facebook      26
Instagram    191
LINE          45
TikTok         2
其他            11
dtype: int64
['Instagram' 'TikTok' 'Facebook' 'LINE' 'Discord' '其他' 'Dcard']

### 練習7: 根據「綜合來說我最喜歡什麼社交軟體？」將資料分組

In [2963]:
grouped_data = data.groupby("綜合來說我最喜歡什麼社交軟體？")
group_sizes = grouped_data.size()
print("各社交軟體偏好人數:")
print(group_sizes)

各社交軟體偏好人數:
綜合來說我最喜歡什麼社交軟體？
Dcard          3
Discord       18
Facebook      26
Instagram    191
LINE          45
TikTok         2
其他            11
dtype: int64

### 練習8: 計算每組的平均使用時間

In [2964]:
avg_usage_by_app = grouped_data["平均每日社群軟體使用時間"].mean()
print("各社交軟體平均使用時間:")
print(avg_usage_by_app)

各社交軟體平均使用時間:
綜合來說我最喜歡什麼社交軟體？
Dcard        3.000000
Discord      4.222222
Facebook     4.692308
Instagram    4.570681
LINE         4.733333
TikTok       6.000000
其他           3.727273
Name: 平均每日社群軟體使用時間, dtype: float64

### 練習9: 計算每種社交軟體的最大與最小年齡

In [2965]:
age_stats_by_app = grouped_data["年紀"].agg(["min", "max"])
print("各社交軟體用戶年齡範圍:")
print(age_stats_by_app)

各社交軟體用戶年齡範圍:
                  min   max
綜合來說我最喜歡什麼社交軟體？
Dcard            20.0  22.0
Discord          19.0  27.0
Facebook         19.0  27.0
Instagram        16.0  32.0
LINE             19.0  45.0
TikTok           20.0  21.0
其他               19.0  24.0